//==================================================================================================================================================================================
//Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.
//==================================================================================================================================================================================
Console.WriteLine("Введите число: ");      //Комментарий ко вводу
string Number = Console.ReadLine() ?? "";  //Вводим число
int inputNumber = int.Parse(Number);       //Преобразуем строковое представление числа в знаковое целое число
int outNumber = 2;                         //Временная переменная
while (outNumber < inputNumber)            //Запускаем цикл
{
    if (outNumber % 2 == 0)                //Проверяем на четность
    {
        Console.Write($"{outNumber}, ");   //Вывод результата в консоль
    }
    outNumber++;                           //Увеличивем временную переменную на 1
}
Console.Write(inputNumber);                //Вывод результата в консоль