//==================================================================================================================================================================================
//Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным.
//==================================================================================================================================================================================
Console.WriteLine("Введите число ");                    //Комментарий ко вводу
string Number = Console.ReadLine() ?? "";               //Вводим число

int inputNumber = int.Parse(Number);                    //Преобразуем строковое представление числа в знаковое целое число

int outResult = (inputNumber % 2);                      //Проверяем на четность
if (outResult == 0)                                     //Проверяем остаток от деления
{
    Console.WriteLine($"Число {inputNumber} четное");   //Вывод результата в консоль
}
else
{
    Console.WriteLine($"Число {inputNumber} нечетное");  //Вывод результата в консоль
}