//==================================================================================================================================================================================
//Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.
//==================================================================================================================================================================================
Console.Write("Введите первое число: ");                                   //Комментарий ко вводу                      
string numberA = Console.ReadLine() ?? "";                                 //Вводим первое число
Console.Write("Введите второе число: ");                                   //Комментарий ко вводу
string numberB = Console.ReadLine() ?? "";                                 //Вводим второе число

int inputNumberA = int.Parse(numberA);                                     //Преобразуем строковое представление первого числа в знаковое целое число
int inputNumberB = int.Parse(numberB);                                     //Преобразуем строковое представление второго числа в знаковое целое число

if (inputNumberA > inputNumberB)                                           //Сравниваем два числа
{
    Console.Write($"Число {inputNumberA} > {inputNumberB}");               //Вывод результата в консоль
}
else if (inputNumberA == inputNumberB)                                     //Сравниваем два числа на равенство
{
    Console.Write($"Число {inputNumberA} = {inputNumberB}");               //Вывод результата в консоль
}
else
{
    Console.Write($"Число {inputNumberB} > {inputNumberA}");               //Вывод результата в консоль
}